#include "onewire.h"
/*******************************************************************************
* 延时函数（@11.0592MHz）
*******************************************************************************/
static void delay600us(void)
{
	//局部函数（static），只在当前的.c文件中使用
    u8 i, j;
	_nop_();//空操作，耗费一个机械周期
    i = 2;
    j = 15;
    do {
        while (--j);
    } while (--i);
}

static void delay60us(void)
{
    u8 i;
    i = 25;
    while (--i);
}

static void delay10us(void)
{
    u8 i;
    i = 2;
    while (--i);
}

/*******************************************************************************
* 函 数 名: oneWire_init
* 函数功能: 单总线初始化
* 返 回 值: 0-有器件应答, 1-无应答
*******************************************************************************/
bit oneWire_init(void)
{
    bit ack;
	EA = 0;                  // 专门控制总线的字段，为0则使CPU拒绝接收中断消息
    oneWire_DQ = 0;          // 拉低总线，发复位脉冲，P37
    delay600us();            // 480-960us
    oneWire_DQ = 1;          // 释放总线
    delay60us();             // 15-60us
    ack = oneWire_DQ;        // 读取应答信号
    delay600us();
    EA = 1;
    return ack;
}

/*******************************************************************************
* 函 数 名: oneWire_sendBit
* 函数功能: 发送一个位
*******************************************************************************/
static void oneWire_sendBit(u8 Bit)
{
    EA = 0;
    oneWire_DQ = 0;          // 拉低起始
    oneWire_DQ = Bit;        // 输出数据
    delay60us();             // 保持60us
    oneWire_DQ = 1;          // 释放总线
    EA = 1;
}

/*******************************************************************************
* 函 数 名: oneWire_receiveBit
* 函数功能: 接收一个位
*******************************************************************************/
static u8 oneWire_receiveBit(void)
{
	/*
	利用了单总线“先拉低触发，再维持电平”的写入特性 。
	无论要发 0 还是 1，它都能用同一套拉低、赋值、锁死等 60 微秒执行组合，
	把一个位传进传感器的寄存器中
	*/
    u8 Bit;
    EA = 0;
    oneWire_DQ = 0;          // 拉低起始
    oneWire_DQ = 1;
    delay10us();             // DS18B20要求15us内采样
    Bit = oneWire_DQ;        // 采样数据
    delay60us();             // 等待时序结束
    EA = 1;
    return Bit;
}

/*******************************************************************************
* 函 数 名: oneWire_sendByte
* 函数功能: 发送一个字节（低位先发）
*******************************************************************************/
void oneWire_sendByte(u8 dat)
{
    u8 i;
    for (i = 0; i < 8; i++)
    {
        oneWire_sendBit(dat & 0x01);
        dat >>= 1;
    }
}

/*******************************************************************************
* 函 数 名: oneWire_receiveByte
* 函数功能: 接收一个字节（低位先收）
*******************************************************************************/
u8 oneWire_receiveByte(void)
{
    u8 dat = 0, i;
    for (i = 0; i < 8; i++)
    {
        dat >>= 1;// 1. 数据右移一位
        if (oneWire_receiveBit())// 2. 读取当前通信线上的二进制位
            dat |= 0x80;//3. 如果读到的是1，就把最高位置1
    }
    return dat;
}
